KanatERPSukhova.КанатАдаптация/src/Documents/КоммерческоеПредложениеКлиенту/КоммерческоеПредложениеКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1b8b67c9-d102-4098-9ab2-841322b60f6e">
  <name>КоммерческоеПредложениеКлиенту</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_НеИспользуетсяВГОЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ИнформацияДляПокупателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d080f3c-06ed-48bf-9709-eea73d676741">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c8a18d99-62ff-45a4-acb5-48e3310c1b53">
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a84a91d2-d326-4bf4-82e6-d573ee35d090">
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="57b31a5d-9fdc-43d2-ae81-67157822c4b6">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/КоммерческоеПредложениеКлиенту/ManagerModule.bsl
//&Вместо("ЗаполнитьТабличныйДокументКоммерческоеПредложениеКлиенту")
//Процедура КАНАТ_ЗаполнитьТабличныйДокументКоммерческоеПредложениеКлиенту(ТабличныйДокумент, ДанныеОбъекта, ПараметрыПечати)
//	
//	//·++·Гурьев·17.08.23·#2.9·Смена макета
//	//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.КоммерческоеПредложениеКлиенту.ПФ_MXL_КоммерческоеПредложениеКлиенту");
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.КоммерческоеПредложениеКлиенту.ПФ_MXL_КАНАТ_КоммерческоеПредложениеКлиенту");
//	//·--·Гурьев·17.08.23
//	
//	//·++·Гурьев·18.08.23·#2.9·Смена таблиц в макете
//	//Если ПараметрыПечати.Свойство("ОтображатьСкидки")
//	//	И Не ПараметрыПечати.ОтображатьСкидки Тогда
//	//	
//	//	Если ДанныеОбъекта.ВариантУказанияСрокаПоставки = Перечисления.ВариантыСроковПоставкиКоммерческихПредложений.НеУказывается Тогда
//	//		ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТовары";
//	//		ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТовары";
//	//		ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТовары";
//	//	Иначе
//	//		ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТоварыСрокПоставки";
//	//		ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТоварыСрокПоставки";
//	//		ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТоварыСрокПоставки";
//	//	КонецЕсли;
//	//	
//	//Иначе
//	//	
//	//	Если ДанныеОбъекта.ВариантУказанияСрокаПоставки = Перечисления.ВариантыСроковПоставкиКоммерческихПредложений.НеУказывается Тогда
//	//		ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТоварыСкидка";
//	//		ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТоварыСкидка";
//	//		ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТоварыСкидка";
//	//	Иначе
//	//		ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТоварыСрокПоставкиСкидка";
//	//		ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТоварыСрокПоставкиСкидка";
//	//		ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТоварыСрокПоставкиСкидка";
//	//	КонецЕсли;
//	//	
//	//КонецЕсли;
//	
//	Если ПараметрыПечати.Свойство("ОтображатьСкидки")
//		И Не ПараметрыПечати.ОтображатьСкидки Тогда
//		
//		Если ДанныеОбъекта.УчитыватьНДС = Истина Тогда
//			ИмяОбластиШапкаТаблицы             = "КАНАТ_ШапкаТаблицыТоварыНДС";
//			ИмяОбластиСтрокаТаблицы            = "КАНАТ_СтрокаТаблицыТоварыНДС";
//			ИмяИменованнойОбластиСтрокаТаблицы = "КАНАТ_ОбластьТоварыНДС";
//		Иначе
//			ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТовары";
//			ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТовары";
//			ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТовары";
//		КонецЕсли;
//		
//	Иначе
//		
//		Если ДанныеОбъекта.УчитыватьНДС = Истина Тогда
//			ИмяОбластиШапкаТаблицы             = "КАНАТ_ШапкаТаблицыТоварыНДССкидка";
//			ИмяОбластиСтрокаТаблицы            = "КАНАТ_СтрокаТаблицыТоварыНДССкидка";
//			ИмяИменованнойОбластиСтрокаТаблицы = "КАНАТ_ОбластьТоварыНДССкидка";
//		Иначе
//			ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТоварыСкидка";
//			ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТоварыСкидка";
//			ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТоварыСкидка";
//		КонецЕсли;
//		
//	КонецЕсли;
//	//·--·Гурьев·18.08.23
//	
//	ОбластьШтрихкода                = Макет.ПолучитьОбласть("ОбластьШтрихкода");
//	ОбластьЗаголовок                = Макет.ПолучитьОбласть("Заголовок");
//	ОбластьКонтактноеЛицо           = Макет.ПолучитьОбласть("КонтактноеЛицо");
//	ОбластьПредлагаемОзнакомиться   = Макет.ПолучитьОбласть("ПредлагаемОзнакомиться");
//	ОбластьШапкаТаблицыТовары       = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
//	ОбластьСтрокаТаблицыТовары      = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
//	ИменованнаяОбластьСтрокаТовары  = ИмяИменованнойОбластиСтрокаТаблицы;
//	ОбластьПодвалТаблицыТовары      = Макет.ПолучитьОбласть("ПодвалТаблицыТовары");
//	ОбластьМенеджер                 = Макет.ПолучитьОбласть("Менеджер");
//	ОбластьПустаяСтрокаТонкая       = Макет.ПолучитьОбласть("ПустаяСтрокаТонкая");
//	ОбластьДополнительнаяИнформация = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
//	ОбластьСрокДействия             = Макет.ПолучитьОбласть("СрокДействияЧастичныйВыкуп");
//	//·++·Гурьев·21.08.23·#2.9·Новые области
//	ОбластьГосОборонЗаказ           = Макет.ПолучитьОбласть("КАНАТ_ОбластьГосОборонЗаказ");
//	ОбластьИнформацияДляПокупателя  = Макет.ПолучитьОбласть("КАНАТ_ИнформацияДляПокупателя");
//	ОбластьПодпись                  = Макет.ПолучитьОбласть("КАНАТ_ОбластьПодпись");
//	//·--·Гурьев·21.08.23
//	КоммерческиеПредложенияДокументыПереопределяемый.ПриВыводеШтриховогоКодаВПечатныеФормы(ТабличныйДокумент, Макет, ОбластьШтрихкода, ДанныеОбъекта);
//	
//	КоммерческиеПредложенияДокументыПереопределяемый.ПриФормированииЗаголовкаПечатнойФормы(Макет, ОбластьЗаголовок, ДанныеОбъекта);
//	
//	ДополнительныеПараметрыВывода = Неопределено;
//	
//	ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
//	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
//	
//	Если ЗначениеЗаполнено(ДанныеОбъекта.КонтактноеЛицо) Тогда
//		ОбластьКонтактноеЛицо.Параметры.Заполнить(ДанныеОбъекта);
//		ТабличныйДокумент.Вывести(ОбластьКонтактноеЛицо);
//	КонецЕсли;
//	
//	ОбластьПредлагаемОзнакомиться.Параметры.Заполнить(ДанныеОбъекта);
//	ТабличныйДокумент.Вывести(ОбластьПредлагаемОзнакомиться);
//	
//	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыТовары);
//	
//	Для Каждого СтрокаТовары Из ДанныеОбъекта.Товары Цикл
//		
//		СтандартнаяОбработка = Истина;
//		КоммерческиеПредложенияДокументыПереопределяемый.ПриВыводеСтрокиТоварыПечатнуюФорму(ТабличныйДокумент,
//		                                                                                    СтрокаТовары,
//		                                                                                    ОбластьСтрокаТаблицыТовары,
//		                                                                                    ИменованнаяОбластьСтрокаТовары,
//		                                                                                    ДополнительныеПараметрыВывода,
//		                                                                                    СтандартнаяОбработка);
//		
//		Если СтандартнаяОбработка Тогда
//			ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(СтрокаТовары);
//			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	ОбластьПодвалТаблицыТовары.Параметры.Заполнить(ДанныеОбъекта);
//	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыТовары);
//	
//	ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаТонкая);
//	
//	ОбластьСрокДействия.Параметры.Заполнить(ДанныеОбъекта);
//	ТабличныйДокумент.Вывести(ОбластьСрокДействия);
//	
//	Если Не ПустаяСтрока(ДанныеОбъекта.УсловияПоставкиПредставление) Тогда
//		
//		ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаТонкая);
//		ОбластьДополнительнаяИнформация.Параметры.Заполнить(ДанныеОбъекта);
//		ТабличныйДокумент.Вывести(ОбластьДополнительнаяИнформация);
//		
//	КонецЕсли;
//	
//	//·++·Гурьев·21.08.23·#2.9·Вывод новых областей
//	Если ДанныеОбъекта.КАНАТ_НеИспользуетсяВГОЗ Тогда
//		ТабличныйДокумент.Вывести(ОбластьГосОборонЗаказ);
//	КонецЕсли;
//	
//	Если Не ПустаяСтрока(ДанныеОбъекта.КАНАТ_ИнформацияДляПокупателя) Тогда
//		ОбластьИнформацияДляПокупателя.Параметры.ИнформацияДляПокупателя = ДанныеОбъекта.КАНАТ_ИнформацияДляПокупателя;
//		ТабличныйДокумент.Вывести(ОбластьИнформацияДляПокупателя);
//	КонецЕсли;
//	
//	//·--·Гурьев·21.08.23

//	ОбластьМенеджер.Параметры.Заполнить(ДанныеОбъекта);
//	ТабличныйДокумент.Вывести(ОбластьМенеджер); 
//	
//	//·++·Гурьев·21.08.23·#2.9·Вывод новых областей
//	ТабличныйДокумент.Вывести(ОбластьПодпись);
//	//·--·Гурьев·21.08.23

//КонецПроцедуры

//&Вместо("ДанныеОбъектаПоДаннымДляПечати")
//Функция КАНАТ_ДанныеОбъектаПоДаннымДляПечати(ДанныеШапки, ТаблицаТовары)
//	
//	ДанныеОбъекта = Новый Структура;
//	
//#Область ДанныеОрганизации
//	
//	СведенияОрганизации = Новый Структура;
//	СведенияОрганизации.Вставить("Наименование");
//	СведенияОрганизации.Вставить("ПолноеНаименование");
//	СведенияОрганизации.Вставить("Телефоны");
//	СведенияОрганизации.Вставить("ЮридическийАдрес");
//	СведенияОрганизации.Вставить("ЭлектроннаяПочта");
//	
//	КоммерческиеПредложенияДокументыПереопределяемый.ЗаполнитьДанныеОрганизации(ДанныеШапки.Организация, СведенияОрганизации);
//	
//	Если ЗначениеЗаполнено(СведенияОрганизации.ПолноеНаименование) Тогда
//		ПредставлениеОрганизации = СведенияОрганизации.ПолноеНаименование;
//	Иначе
//		ПредставлениеОрганизации = СведенияОрганизации.Наименование;
//	КонецЕсли;
//	
//	//·++·Гурьев·17.08.23·#2.9·Представление организации с реквизитами
//	ДанныеОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеШапки.Организация, ТекущаяДата());
//	//·++·Гурьев·17.08.23
//	
//#КонецОбласти
//	
//#Область КонтактнаяИнформация
//	
//	Если ЗначениеЗаполнено(ДанныеШапки.Менеджер) Тогда
//		
//		МассивСМенеджером = Новый Массив;
//		МассивСМенеджером.Добавить(ДанныеШапки.Менеджер);
//		
//		ТребуемыеТипыКонтактнойИнформации = Новый Массив;
//		ТребуемыеТипыКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
//		
//		ТаблицаКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
//		                                   МассивСМенеджером,
//		                                   ТребуемыеТипыКонтактнойИнформации,,
//		                                   ДанныеШапки.Дата);
//		
//		АдресЭлектроннойПочтыМенеджера = КоммерческиеПредложенияДокументы.ПредставлениеКонтактнойИнформацииИзТаблицы(
//		                                   ТаблицаКонтактнойИнформации,
//		                                   Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
//		
//	Иначе
//		ТелефонМенеджера = "";
//		АдресЭлектроннойПочтыМенеджера   = "";
//	КонецЕсли;
//	
//	//·++·Гурьев·18.08.23·#2.9·Представление контрагента
//	ПредставлениеКлиента = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеШапки.Контрагент, ДанныеШапки.Дата),
//			"НаименованиеДляПечатныхФорм,ИНН,ЮридическийАдрес,Телефоны,АдресЭлектроннойПочты");
//	//·--·Гурьев·18.08.23
//	
//#КонецОбласти

//#Область Товары

//	ЕстьСкидки = Ложь;
//	ДанныеОбъекта.Вставить("СуммаВсего", 0);
//	ДанныеОбъекта.Вставить("СуммаВсегоНДС", 0);
//	ДанныеОбъекта.Вставить("КоличествоТоваров", 0);
//	ДанныеОбъекта.Вставить("Товары", Новый Массив);
//	
//	Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
//		
//		Если СтрокаТовары.СуммаСкидки <> 0 Тогда
//			ЕстьСкидки = Истина;
//		КонецЕсли;
//		
//		ДанныеОбъекта.СуммаВсего        = ДанныеОбъекта.СуммаВсего + СтрокаТовары.Сумма;
//		ДанныеОбъекта.СуммаВсегоНДС     = ДанныеОбъекта.СуммаВсегоНДС + СтрокаТовары.СуммаНДС;
//		ДанныеОбъекта.КоличествоТоваров = ДанныеОбъекта.КоличествоТоваров + 1;
//		
//		СтрокаТаблицыТовары = Новый Структура;
//		
//		НаименованиеТовара = КоммерческиеПредложенияДокументыКлиентСервер.ПредставлениеНоменклатурыДляПечати(СтрокаТовары.Номенклатура, СтрокаТовары.Характеристика);
//		
//		СтрокаТаблицыТовары.Вставить("НомерСтроки",      СтрокаТовары.НомерСтроки);
//		СтрокаТаблицыТовары.Вставить("Номенклатура",     НаименованиеТовара);
//		СтрокаТаблицыТовары.Вставить("Количество",       СтрокаТовары.Количество);
//		СтрокаТаблицыТовары.Вставить("ЕдиницаИзмерения", СтрокаТовары.ЕдиницаИзмерения);
//		СтрокаТаблицыТовары.Вставить("Цена",             Формат(СтрокаТовары.Цена,"ЧДЦ=2; ЧРД=."));
//		СтрокаТаблицыТовары.Вставить("СуммаСНДС",        Формат(СтрокаТовары.СуммаСНДС,"ЧДЦ=2; ЧРД=."));
//		СтрокаТаблицыТовары.Вставить("СуммаСкидки",      Формат(СтрокаТовары.СуммаСкидки,"ЧДЦ=2; ЧРД=."));
//		СтрокаТаблицыТовары.Вставить("СрокПоставки",     КоммерческиеПредложенияДокументыКлиентСервер.СрокПоставкиСтрокой(ДанныеШапки.ВариантУказанияСрокаПоставки, 
//		                                                                                                                  СтрокаТовары.СрокПоставки));
//		//·++·Гурьев·18.08.23·#2.9·Добавление данных из таблицы
//		СтрокаТаблицыТовары.Вставить("Сумма",            СтрокаТовары.Сумма);
//		СтрокаТаблицыТовары.Вставить("СуммаНДС",            СтрокаТовары.СуммаНДС);
//		//·--·Гурьев·18.08.23
//		
//		КоммерческиеПредложенияДокументыПереопределяемый.ДополнитьДанныеОбъектаДляПечати(СтрокаТаблицыТовары, СтрокаТовары, ДанныеОбъекта);
//		
//		ДанныеОбъекта.Товары.Добавить(СтрокаТаблицыТовары);
//		
//	КонецЦикла;

//#КонецОбласти

//#Область ЗаполнениеДанныхОбъекта 

//	ПредставлениеСуммДокумента = КоммерческиеПредложенияДокументы.ПредставлениеСуммДокументаДляПечати(ДанныеШапки,
//	                                                                                                  ДанныеОбъекта.СуммаВсего,
//	                                                                                                  ДанныеОбъекта.СуммаВсегоНДС,
//	                                                                                                  ДанныеОбъекта.КоличествоТоваров);
//	
//	ДанныеОбъекта.Вставить("Ссылка",                              ДанныеШапки.Ссылка);
//	ДанныеОбъекта.Вставить("Организация",                         ДанныеШапки.Организация);
//	ДанныеОбъекта.Вставить("ТелефонОрганизации",                  СведенияОрганизации.Телефоны);
//	ДанныеОбъекта.Вставить("АдресОрганизации",                    СведенияОрганизации.ЮридическийАдрес);
//	ДанныеОбъекта.Вставить("АдресЭлектроннойПочтыОрганизации",    ?(СведенияОрганизации.Свойство("ЭлектроннаяПочта"),СведенияОрганизации.ЭлектроннаяПочта, ""));
//	ДанныеОбъекта.Вставить("Клиент",                              ДанныеШапки.Клиент);
//	ДанныеОбъекта.Вставить("Контрагент",                          ДанныеШапки.Контрагент);
//	ДанныеОбъекта.Вставить("ПредставлениеОрганизации",            ПредставлениеОрганизации);
//	//·++·Гурьев·18.08.23·#2.9·Представление контрагента
//	//ДанныеОбъекта.Вставить("ПредставлениеКлиента",                ПредставлениеКлиента(ДанныеОбъекта.Клиент, ДанныеОбъекта.Контрагент));
//	ДанныеОбъекта.Вставить("ПредставлениеКлиента",                ПредставлениеКлиента);
//	//·--·Гурьев·18.08.23
//	ДанныеОбъекта.Вставить("КонтактноеЛицо",                      ДанныеШапки.КонтактноеЛицо);
//	ДанныеОбъекта.Вставить("Менеджер",                            ДанныеШапки.Менеджер);
//	ДанныеОбъекта.Вставить("АдресЭлектроннойПочтыМенеджера",      АдресЭлектроннойПочтыМенеджера);
//	ДанныеОбъекта.Вставить("ТелефонМенеджера",                    ТелефонМенеджера);
//	ДанныеОбъекта.Вставить("Номер",                               ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеШапки.Номер, Ложь, Истина));
//	ДанныеОбъекта.Вставить("Дата",                                Формат(ДанныеШапки.Дата,"ДЛФ=D"));
//	ДанныеОбъекта.Вставить("ВариантУказанияСрокаПоставки",        ДанныеШапки.ВариантУказанияСрокаПоставки);
//	ДанныеОбъекта.Вставить("УсловияОплаты",                       ДанныеШапки.УсловияОплаты);
//	ДанныеОбъекта.Вставить("УсловияДоставки",                     ДанныеШапки.УсловияДоставки);
//	ДанныеОбъекта.Вставить("ПрочиеУсловия",                       ДанныеШапки.ПрочиеУсловия);
//	ДанныеОбъекта.Вставить("КонтактнаяИнформацияПредложения",     КонтактнаяИнформацияПредложения(ДанныеОбъекта));
//	ДанныеОбъекта.Вставить("ИтоговаяСтрока",                      ПредставлениеСуммДокумента.ИтоговаяСтрока);
//	ДанныеОбъекта.Вставить("СуммаПрописью",                       ПредставлениеСуммДокумента.СуммаПрописью);
//	ДанныеОбъекта.Вставить("ЕстьСкидки",                          ЕстьСкидки);
//	ДанныеОбъекта.Вставить("ПредставлениеСрокаДействия",          КоммерческиеПредложенияДокументы.ПредставлениеСрокаДействияДляПечати(ЕстьСкидки, ДанныеШапки.СрокДействия));
//	ДанныеОбъекта.Вставить("ПредставлениеЧастичногоВыкупа",       КоммерческиеПредложенияДокументы.ПредставлениеЧастичногоВыкупаДляПечати(ДанныеШапки.МожетВыкупатьсяЧастично));
//	ДанныеОбъекта.Вставить("УсловияПоставкиПредставление",        КоммерческиеПредложенияДокументы.ПредставлениеУсловийПоставкиДляПечати(ДанныеОбъекта.УсловияОплаты, 
//	                                                                                                                                     ДанныеОбъекта.УсловияДоставки, 
//	                                                                                                                                     ДанныеОбъекта.ПрочиеУсловия));
//	//·++·Гурьев·17.08.23·#2.9·Добавление доп. данных
//	ДанныеОбъекта.Вставить("ИННОрганизации",                      ДанныеОрганизации.ИНН);
//	ДанныеОбъекта.Вставить("ТелефонОрганизации",                  ДанныеОрганизации.Телефоны);
//	ДанныеОбъекта.Вставить("ПочтаОрганизации",                    ДанныеОрганизации.АдресЭлектроннойПочты);
//	ДанныеОбъекта.Вставить("УчитыватьНДС",                        ДанныеШапки.УчитыватьНДС);
//	ДанныеОбъекта.Вставить("ЦенаВключаетНДС",                     ДанныеШапки.ЦенаВключаетНДС);
//	ДанныеОбъекта.Вставить("КАНАТ_НеИспользуетсяВГОЗ",            ДанныеШапки.КАНАТ_НеИспользуетсяВГОЗ);
//	ДанныеОбъекта.Вставить("КАНАТ_ИнформацияДляПокупателя",       ДанныеШапки.КАНАТ_ИнформацияДляПокупателя);
//	//·++·Гурьев·21.08.23
//	
//#КонецОбласти
//	
//	Возврат ДанныеОбъекта;
//	
//КонецФункции

Функция КАНАТ_ПредставлениеКлиента(Клиент, Контрагент)
	
	
	
КонецФункции

//&Вместо("ДанныеДляПечати")
//Функция КАНАТ_ДанныеДляПечати(МассивОбъектов, ПараметрыПечати)
//	
//	СтруктураДанныхДляПечати = Неопределено;
//	СтандартнаяОбработка = Истина;
//	КоммерческиеПредложенияДокументыПереопределяемый.КоммерческоеПредложениеКлиентуПриФормированииСтруктурыДанныхПечати(
//		МассивОбъектов,
//		СтруктураДанныхДляПечати,
//		ПараметрыПечати,
//		СтандартнаяОбработка);
//		
//	Если Не СтандартнаяОбработка Тогда
//		Возврат СтруктураДанныхДляПечати;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
//	
//	ОтображатьСкидки = Истина;
//	Если ПараметрыПечати.Свойство("ОтображатьСкидки")
//		И Не ПараметрыПечати.ОтображатьСкидки Тогда
//		ОтображатьСкидки = Ложь;
//	КонецЕсли;
//	
//	Запрос.УстановитьПараметр("ОтображатьСкидки", ОтображатьСкидки);
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	КоммерческоеПредложениеКлиенту.Ссылка                              КАК Ссылка,
//	|	КоммерческоеПредложениеКлиенту.Дата                                КАК Дата,
//	|	КоммерческоеПредложениеКлиенту.Номер                               КАК Номер,
//	|	КоммерческоеПредложениеКлиенту.Менеджер                            КАК Менеджер,
//	|	КоммерческоеПредложениеКлиенту.КонтактноеЛицо                      КАК КонтактноеЛицо,
//	|	КоммерческоеПредложениеКлиенту.Организация                         КАК Организация,
//	|	КоммерческоеПредложениеКлиенту.СрокДействия                        КАК СрокДействия,
//	|	КоммерческоеПредложениеКлиенту.Валюта                              КАК Валюта,
//	|	КоммерческоеПредложениеКлиенту.ЦенаВключаетНДС                     КАК ЦенаВключаетНДС,
//	|	КоммерческоеПредложениеКлиенту.Налогообложение                     КАК УчитыватьНДС,
//	|	КоммерческоеПредложениеКлиенту.УсловияДоставкиТекст                КАК УсловияДоставки,
//	|	КоммерческоеПредложениеКлиенту.УсловияОплатыТекст                  КАК УсловияОплаты,
//	|	КоммерческоеПредложениеКлиенту.ПрочаяДополнительнаяИнформацияТекст КАК ПрочиеУсловия,
//	|	КоммерческоеПредложениеКлиенту.Клиент                              КАК Клиент,
//	|	КоммерческоеПредложениеКлиенту.Контрагент                          КАК Контрагент,
//	|	КоммерческоеПредложениеКлиенту.ВариантУказанияСрокаПоставки        КАК ВариантУказанияСрокаПоставки,
//	|	КоммерческоеПредложениеКлиенту.КАНАТ_НеИспользуетсяВГОЗ            КАК КАНАТ_НеИспользуетсяВГОЗ,
//	|	КоммерческоеПредложениеКлиенту.КАНАТ_ИнформацияДляПокупателя       КАК КАНАТ_ИнформацияДляПокупателя,
//	|	КоммерческоеПредложениеКлиенту.МожетВыкупатьсяЧастично             КАК МожетВыкупатьсяЧастично
//	|ИЗ
//	|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
//	|ГДЕ
//	|	КоммерческоеПредложениеКлиенту.Ссылка В(&МассивОбъектов)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Товары.Ссылка                                                   КАК Ссылка,
//	|	Товары.НомерСтроки                                              КАК НомерСтроки,
//	|	Товары.Номенклатура                                             КАК Номенклатура,
//	|	Товары.Характеристика                                           КАК Характеристика,
//	|	Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки     КАК СуммаСкидки,
//	|	Товары.ПроцентРучнойСкидки + Товары.ПроцентАвтоматическойСкидки КАК ПроцентСкидки,
//	|	&УсловияЕдиницыИзмерения                                        КАК ЕдиницаИзмерения,
//	|	Товары.Количество                                               КАК Количество,
//	|ВЫБОР
//	|	КОГДА &ОтображатьСкидки
//	|		ТОГДА Товары.Цена
//	|	ИНАЧЕ ВЫБОР
//	|			КОГДА Товары.Количество = 0
//	|				ТОГДА 0
//	|			ИНАЧЕ Товары.Сумма / Товары.Количество
//	|		КОНЕЦ
//	|КОНЕЦ                                                              КАК Цена,
//	|	Товары.СуммаСНДС                                                КАК СуммаСНДС,
//	|	Товары.Сумма                                                    КАК Сумма,
//	|	Товары.СуммаНДС                                                 КАК СуммаНДС,
//	|	Товары.СрокПоставки                                             КАК СрокПоставки
//	|ИЗ
//	|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК Товары
//	|ГДЕ
//	|	Товары.Ссылка В(&МассивОбъектов)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Ссылка,
//	|	НомерСтроки";
//	
//	УсловияЕдиницыИзмерения = "Товары.ЕдиницаИзмерения";
//	КоммерческиеПредложенияДокументыПереопределяемый.ПолучитьТекстЗапросаПолученияЕдиницыИзмерения(УсловияЕдиницыИзмерения);
//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияЕдиницыИзмерения", УсловияЕдиницыИзмерения);
//	
//	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет(); // Массив из ВыборкаИзРезультатаЗапроса
//	
//	СтруктураДанныхДляПечати = Новый Структура;
//	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке",   ПакетРезультатовЗапроса[0]);
//	СтруктураДанныхДляПечати.Вставить("РезультатПоТоварам", ПакетРезультатовЗапроса[1]);
//	
//	Возврат СтруктураДанныхДляПечати;
//	
//КонецФункции

&ИзменениеИКонтроль("ЗаполнитьТабличныйДокументКоммерческоеПредложениеКлиенту")
Процедура КАНАТ_ЗаполнитьТабличныйДокументКоммерческоеПредложениеКлиенту(ТабличныйДокумент, ДанныеОбъекта, ПараметрыПечати)
	#Удаление
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.КоммерческоеПредложениеКлиенту.ПФ_MXL_КоммерческоеПредложениеКлиенту");

	Если ПараметрыПечати.Свойство("ОтображатьСкидки")
		И Не ПараметрыПечати.ОтображатьСкидки Тогда

		Если ДанныеОбъекта.ВариантУказанияСрокаПоставки = Перечисления.ВариантыСроковПоставкиКоммерческихПредложений.НеУказывается Тогда
			ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТовары";
			ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТовары";
			ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТовары";
		Иначе
			ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТоварыСрокПоставки";
			ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТоварыСрокПоставки";
			ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТоварыСрокПоставки";
		КонецЕсли;

	Иначе

		Если ДанныеОбъекта.ВариантУказанияСрокаПоставки = Перечисления.ВариантыСроковПоставкиКоммерческихПредложений.НеУказывается Тогда
			ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТоварыСкидка";
			ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТоварыСкидка";
			ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТоварыСкидка";
		Иначе
			ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТоварыСрокПоставкиСкидка";
			ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТоварыСрокПоставкиСкидка";
			ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТоварыСрокПоставкиСкидка";
		КонецЕсли;

	КонецЕсли;

	ОбластьШтрихкода                = Макет.ПолучитьОбласть("ОбластьШтрихкода");
	ОбластьЗаголовок                = Макет.ПолучитьОбласть("Заголовок");
	ОбластьКонтактноеЛицо           = Макет.ПолучитьОбласть("КонтактноеЛицо");
	ОбластьПредлагаемОзнакомиться   = Макет.ПолучитьОбласть("ПредлагаемОзнакомиться");
	ОбластьШапкаТаблицыТовары       = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
	ОбластьСтрокаТаблицыТовары      = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
	ИменованнаяОбластьСтрокаТовары  = ИмяИменованнойОбластиСтрокаТаблицы;
	ОбластьПодвалТаблицыТовары      = Макет.ПолучитьОбласть("ПодвалТаблицыТовары");
	ОбластьМенеджер                 = Макет.ПолучитьОбласть("Менеджер");
	ОбластьПустаяСтрокаТонкая       = Макет.ПолучитьОбласть("ПустаяСтрокаТонкая");
	ОбластьДополнительнаяИнформация = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
	ОбластьСрокДействия             = Макет.ПолучитьОбласть("СрокДействияЧастичныйВыкуп");

	КоммерческиеПредложенияДокументыПереопределяемый.ПриВыводеШтриховогоКодаВПечатныеФормы(ТабличныйДокумент, Макет, ОбластьШтрихкода, ДанныеОбъекта);

	КоммерческиеПредложенияДокументыПереопределяемый.ПриФормированииЗаголовкаПечатнойФормы(Макет, ОбластьЗаголовок, ДанныеОбъекта);

	ДополнительныеПараметрыВывода = Неопределено;

	ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);

	Если ЗначениеЗаполнено(ДанныеОбъекта.КонтактноеЛицо) Тогда
		ОбластьКонтактноеЛицо.Параметры.Заполнить(ДанныеОбъекта);
		ТабличныйДокумент.Вывести(ОбластьКонтактноеЛицо);
	КонецЕсли;

	ОбластьПредлагаемОзнакомиться.Параметры.Заполнить(ДанныеОбъекта);
	ТабличныйДокумент.Вывести(ОбластьПредлагаемОзнакомиться);

	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыТовары);

	Для Каждого СтрокаТовары Из ДанныеОбъекта.Товары Цикл

		СтандартнаяОбработка = Истина;
		КоммерческиеПредложенияДокументыПереопределяемый.ПриВыводеСтрокиТоварыПечатнуюФорму(ТабличныйДокумент,
		СтрокаТовары,
		ОбластьСтрокаТаблицыТовары,
		ИменованнаяОбластьСтрокаТовары,
		ДополнительныеПараметрыВывода,
		СтандартнаяОбработка);

		Если СтандартнаяОбработка Тогда
			ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(СтрокаТовары);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
		КонецЕсли;

	КонецЦикла;

	ОбластьПодвалТаблицыТовары.Параметры.Заполнить(ДанныеОбъекта);
	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыТовары);

	ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаТонкая);

	ОбластьСрокДействия.Параметры.Заполнить(ДанныеОбъекта);
	ТабличныйДокумент.Вывести(ОбластьСрокДействия);

	Если Не ПустаяСтрока(ДанныеОбъекта.УсловияПоставкиПредставление) Тогда

		ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаТонкая);
		ОбластьДополнительнаяИнформация.Параметры.Заполнить(ДанныеОбъекта);
		ТабличныйДокумент.Вывести(ОбластьДополнительнаяИнформация);

	КонецЕсли;
   	#КонецУдаления
	#Вставка
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.КоммерческоеПредложениеКлиенту.ПФ_MXL_КАНАТ_КоммерческоеПредложениеКлиенту");
	//·--·Гурьев·17.08.23
	
	Если ПараметрыПечати.Свойство("ОтображатьСкидки")
		И Не ПараметрыПечати.ОтображатьСкидки Тогда
		
		Если ДанныеОбъекта.УчитыватьНДС = Истина Тогда
			ИмяОбластиШапкаТаблицы             = "КАНАТ_ШапкаТаблицыТоварыНДС";
			ИмяОбластиСтрокаТаблицы            = "КАНАТ_СтрокаТаблицыТоварыНДС";
			ИмяИменованнойОбластиСтрокаТаблицы = "КАНАТ_ОбластьТоварыНДС";
		Иначе
			ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТовары";
			ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТовары";
			ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТовары";
		КонецЕсли;
		
	Иначе
		
		Если ДанныеОбъекта.УчитыватьНДС = Истина Тогда
			ИмяОбластиШапкаТаблицы             = "КАНАТ_ШапкаТаблицыТоварыНДССкидка";
			ИмяОбластиСтрокаТаблицы            = "КАНАТ_СтрокаТаблицыТоварыНДССкидка";
			ИмяИменованнойОбластиСтрокаТаблицы = "КАНАТ_ОбластьТоварыНДССкидка";
		Иначе
			ИмяОбластиШапкаТаблицы             = "ШапкаТаблицыТоварыСкидка";
			ИмяОбластиСтрокаТаблицы            = "СтрокаТаблицыТоварыСкидка";
			ИмяИменованнойОбластиСтрокаТаблицы = "ОбластьТоварыСкидка";
		КонецЕсли;
		
	КонецЕсли;
	//·--·Гурьев·18.08.23
	
	ОбластьШтрихкода                = Макет.ПолучитьОбласть("ОбластьШтрихкода");
	ОбластьЗаголовок                = Макет.ПолучитьОбласть("Заголовок");
	ОбластьКонтактноеЛицо           = Макет.ПолучитьОбласть("КонтактноеЛицо");
	ОбластьПредлагаемОзнакомиться   = Макет.ПолучитьОбласть("ПредлагаемОзнакомиться");
	ОбластьШапкаТаблицыТовары       = Макет.ПолучитьОбласть(ИмяОбластиШапкаТаблицы);
	ОбластьСтрокаТаблицыТовары      = Макет.ПолучитьОбласть(ИмяОбластиСтрокаТаблицы);
	ИменованнаяОбластьСтрокаТовары  = ИмяИменованнойОбластиСтрокаТаблицы;
	ОбластьПодвалТаблицыТовары      = Макет.ПолучитьОбласть("ПодвалТаблицыТовары");
	ОбластьМенеджер                 = Макет.ПолучитьОбласть("Менеджер");
	ОбластьПустаяСтрокаТонкая       = Макет.ПолучитьОбласть("ПустаяСтрокаТонкая");
	ОбластьДополнительнаяИнформация = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
	ОбластьСрокДействия             = Макет.ПолучитьОбласть("СрокДействияЧастичныйВыкуп");
	//·++·Гурьев·21.08.23·#2.9·Новые области
	ОбластьГосОборонЗаказ           = Макет.ПолучитьОбласть("КАНАТ_ОбластьГосОборонЗаказ");
	ОбластьИнформацияДляПокупателя  = Макет.ПолучитьОбласть("КАНАТ_ИнформацияДляПокупателя");
	ОбластьПодпись                  = Макет.ПолучитьОбласть("КАНАТ_ОбластьПодпись");
	//·--·Гурьев·21.08.23
	КоммерческиеПредложенияДокументыПереопределяемый.ПриВыводеШтриховогоКодаВПечатныеФормы(ТабличныйДокумент, Макет, ОбластьШтрихкода, ДанныеОбъекта);
	
	КоммерческиеПредложенияДокументыПереопределяемый.ПриФормированииЗаголовкаПечатнойФормы(Макет, ОбластьЗаголовок, ДанныеОбъекта);
	
	ДополнительныеПараметрыВывода = Неопределено;
	
	ОбластьЗаголовок.Параметры.Заполнить(ДанныеОбъекта);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Если ЗначениеЗаполнено(ДанныеОбъекта.КонтактноеЛицо) Тогда
		ОбластьКонтактноеЛицо.Параметры.Заполнить(ДанныеОбъекта);
		ТабличныйДокумент.Вывести(ОбластьКонтактноеЛицо);
	КонецЕсли;
	
	ОбластьПредлагаемОзнакомиться.Параметры.Заполнить(ДанныеОбъекта);
	ТабличныйДокумент.Вывести(ОбластьПредлагаемОзнакомиться);
	
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицыТовары);
	
	Для Каждого СтрокаТовары Из ДанныеОбъекта.Товары Цикл
		
		СтандартнаяОбработка = Истина;
		КоммерческиеПредложенияДокументыПереопределяемый.ПриВыводеСтрокиТоварыПечатнуюФорму(ТабличныйДокумент,
		                                                                                    СтрокаТовары,
		                                                                                    ОбластьСтрокаТаблицыТовары,
		                                                                                    ИменованнаяОбластьСтрокаТовары,
		                                                                                    ДополнительныеПараметрыВывода,
		                                                                                    СтандартнаяОбработка);
		
		Если СтандартнаяОбработка Тогда
			ОбластьСтрокаТаблицыТовары.Параметры.Заполнить(СтрокаТовары);
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицыТовары);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластьПодвалТаблицыТовары.Параметры.Заполнить(ДанныеОбъекта);
	ТабличныйДокумент.Вывести(ОбластьПодвалТаблицыТовары);
	
	ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаТонкая);
	
	ОбластьСрокДействия.Параметры.Заполнить(ДанныеОбъекта);
	ТабличныйДокумент.Вывести(ОбластьСрокДействия);
	
	Если Не ПустаяСтрока(ДанныеОбъекта.УсловияПоставкиПредставление) Тогда
		
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрокаТонкая);
		ОбластьДополнительнаяИнформация.Параметры.Заполнить(ДанныеОбъекта);
		ТабличныйДокумент.Вывести(ОбластьДополнительнаяИнформация);
		
	КонецЕсли;
	
	//·++·Гурьев·21.08.23·#2.9·Вывод новых областей
	Если ДанныеОбъекта.КАНАТ_НеИспользуетсяВГОЗ Тогда
		ТабличныйДокумент.Вывести(ОбластьГосОборонЗаказ);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ДанныеОбъекта.КАНАТ_ИнформацияДляПокупателя) Тогда
		ОбластьИнформацияДляПокупателя.Параметры.ИнформацияДляПокупателя = ДанныеОбъекта.КАНАТ_ИнформацияДляПокупателя;
		ТабличныйДокумент.Вывести(ОбластьИнформацияДляПокупателя);
	КонецЕсли;
	
	//·--·Гурьев·21.08.23

	#КонецВставки
	ОбластьМенеджер.Параметры.Заполнить(ДанныеОбъекта);
	ТабличныйДокумент.Вывести(ОбластьМенеджер);  
	#Вставка
	//·++·Гурьев·21.08.23·#2.9·Вывод новых областей
	ТабличныйДокумент.Вывести(ОбластьПодпись);
	//·--·Гурьев·21.08.23
	#КонецВСтавки

КонецПроцедуры

&ИзменениеИКонтроль("ДанныеОбъектаПоДаннымДляПечати")
Функция КАНАТ_ДанныеОбъектаПоДаннымДляПечати(ДанныеШапки, ТаблицаТовары)

	ДанныеОбъекта = Новый Структура;

	#Область ДанныеОрганизации

	СведенияОрганизации = Новый Структура;
	СведенияОрганизации.Вставить("Наименование");
	СведенияОрганизации.Вставить("ПолноеНаименование");
	СведенияОрганизации.Вставить("Телефоны");
	СведенияОрганизации.Вставить("ЮридическийАдрес");
	СведенияОрганизации.Вставить("ЭлектроннаяПочта");

	КоммерческиеПредложенияДокументыПереопределяемый.ЗаполнитьДанныеОрганизации(ДанныеШапки.Организация, СведенияОрганизации);

	Если ЗначениеЗаполнено(СведенияОрганизации.ПолноеНаименование) Тогда
		ПредставлениеОрганизации = СведенияОрганизации.ПолноеНаименование;
	Иначе
		ПредставлениеОрганизации = СведенияОрганизации.Наименование;
	КонецЕсли;
    #Вставка
	ДанныеОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеШапки.Организация, ТекущаяДата());
	#КонецВставки
	#КонецОбласти

	#Область КонтактнаяИнформация

	Если ЗначениеЗаполнено(ДанныеШапки.Менеджер) Тогда

		МассивСМенеджером = Новый Массив;
		МассивСМенеджером.Добавить(ДанныеШапки.Менеджер);

		ТребуемыеТипыКонтактнойИнформации = Новый Массив;
		ТребуемыеТипыКонтактнойИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);

		ТаблицаКонтактнойИнформации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		МассивСМенеджером,
		ТребуемыеТипыКонтактнойИнформации,,
		ДанныеШапки.Дата);

		АдресЭлектроннойПочтыМенеджера = КоммерческиеПредложенияДокументы.ПредставлениеКонтактнойИнформацииИзТаблицы(
		ТаблицаКонтактнойИнформации,
		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);

	Иначе
		ТелефонМенеджера = "";
		АдресЭлектроннойПочтыМенеджера   = "";
	КонецЕсли;
    #Вставка
	//·++·Гурьев·18.08.23·#2.9·Представление контрагента
	ПредставлениеКлиента = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеШапки.Контрагент, ДанныеШапки.Дата),
			"НаименованиеДляПечатныхФорм,ИНН,ЮридическийАдрес,Телефоны,АдресЭлектроннойПочты");
	//·--·Гурьев·18.08.23
	#КонецВставки
	#КонецОбласти

	#Область Товары

	ЕстьСкидки = Ложь;
	ДанныеОбъекта.Вставить("СуммаВсего", 0);
	ДанныеОбъекта.Вставить("СуммаВсегоНДС", 0);
	ДанныеОбъекта.Вставить("КоличествоТоваров", 0);
	ДанныеОбъекта.Вставить("Товары", Новый Массив);

	Для Каждого СтрокаТовары Из ТаблицаТовары Цикл

		Если СтрокаТовары.СуммаСкидки <> 0 Тогда
			ЕстьСкидки = Истина;
		КонецЕсли;

		ДанныеОбъекта.СуммаВсего        = ДанныеОбъекта.СуммаВсего + СтрокаТовары.Сумма;
		ДанныеОбъекта.СуммаВсегоНДС     = ДанныеОбъекта.СуммаВсегоНДС + СтрокаТовары.СуммаНДС;
		ДанныеОбъекта.КоличествоТоваров = ДанныеОбъекта.КоличествоТоваров + 1;

		СтрокаТаблицыТовары = Новый Структура;

		НаименованиеТовара = КоммерческиеПредложенияДокументыКлиентСервер.ПредставлениеНоменклатурыДляПечати(СтрокаТовары.Номенклатура, СтрокаТовары.Характеристика);

		СтрокаТаблицыТовары.Вставить("НомерСтроки",      СтрокаТовары.НомерСтроки);
		СтрокаТаблицыТовары.Вставить("Номенклатура",     НаименованиеТовара);
		СтрокаТаблицыТовары.Вставить("Количество",       СтрокаТовары.Количество);
		СтрокаТаблицыТовары.Вставить("ЕдиницаИзмерения", СтрокаТовары.ЕдиницаИзмерения);
		СтрокаТаблицыТовары.Вставить("Цена",             Формат(СтрокаТовары.Цена,"ЧДЦ=2; ЧРД=."));
		СтрокаТаблицыТовары.Вставить("СуммаСНДС",        Формат(СтрокаТовары.СуммаСНДС,"ЧДЦ=2; ЧРД=."));
		СтрокаТаблицыТовары.Вставить("СуммаСкидки",      Формат(СтрокаТовары.СуммаСкидки,"ЧДЦ=2; ЧРД=."));
		СтрокаТаблицыТовары.Вставить("СрокПоставки",     КоммерческиеПредложенияДокументыКлиентСервер.СрокПоставкиСтрокой(ДанныеШапки.ВариантУказанияСрокаПоставки, 
		СтрокаТовары.СрокПоставки));
        #Вставка
		//·++·Гурьев·18.08.23·#2.9·Добавление данных из таблицы
		СтрокаТаблицыТовары.Вставить("Сумма",            СтрокаТовары.Сумма);
		СтрокаТаблицыТовары.Вставить("СуммаНДС",            СтрокаТовары.СуммаНДС);
		//·--·Гурьев·18.08.23
		#КонецВставки
		КоммерческиеПредложенияДокументыПереопределяемый.ДополнитьДанныеОбъектаДляПечати(СтрокаТаблицыТовары, СтрокаТовары, ДанныеОбъекта);

		ДанныеОбъекта.Товары.Добавить(СтрокаТаблицыТовары);

	КонецЦикла;

	#КонецОбласти

	#Область ЗаполнениеДанныхОбъекта 

	ПредставлениеСуммДокумента = КоммерческиеПредложенияДокументы.ПредставлениеСуммДокументаДляПечати(ДанныеШапки,
	ДанныеОбъекта.СуммаВсего,
	ДанныеОбъекта.СуммаВсегоНДС,
	ДанныеОбъекта.КоличествоТоваров);

	ДанныеОбъекта.Вставить("Ссылка",                              ДанныеШапки.Ссылка);
	ДанныеОбъекта.Вставить("Организация",                         ДанныеШапки.Организация);
	ДанныеОбъекта.Вставить("ТелефонОрганизации",                  СведенияОрганизации.Телефоны);
	ДанныеОбъекта.Вставить("АдресОрганизации",                    СведенияОрганизации.ЮридическийАдрес);
	ДанныеОбъекта.Вставить("АдресЭлектроннойПочтыОрганизации",    ?(СведенияОрганизации.Свойство("ЭлектроннаяПочта"),СведенияОрганизации.ЭлектроннаяПочта, ""));
	ДанныеОбъекта.Вставить("Клиент",                              ДанныеШапки.Клиент);
	ДанныеОбъекта.Вставить("Контрагент",                          ДанныеШапки.Контрагент);
	ДанныеОбъекта.Вставить("ПредставлениеОрганизации",            ПредставлениеОрганизации);
	ДанныеОбъекта.Вставить("ПредставлениеКлиента",                ПредставлениеКлиента(ДанныеОбъекта.Клиент, ДанныеОбъекта.Контрагент));
	#Вставка
	//·++·Гурьев·18.08.23·#2.9·Представление контрагента
	//ДанныеОбъекта.Вставить("ПредставлениеКлиента",                ПредставлениеКлиента(ДанныеОбъекта.Клиент, ДанныеОбъекта.Контрагент));
	ДанныеОбъекта.Вставить("ПредставлениеКлиента",                ПредставлениеКлиента);
	//·--·Гурьев·18.08.23	
	#КонецВСтавки
	ДанныеОбъекта.Вставить("КонтактноеЛицо",                      ДанныеШапки.КонтактноеЛицо);
	ДанныеОбъекта.Вставить("Менеджер",                            ДанныеШапки.Менеджер);
	ДанныеОбъекта.Вставить("АдресЭлектроннойПочтыМенеджера",      АдресЭлектроннойПочтыМенеджера);
	ДанныеОбъекта.Вставить("ТелефонМенеджера",                    ТелефонМенеджера);
	ДанныеОбъекта.Вставить("Номер",                               ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеШапки.Номер, Ложь, Истина));
	ДанныеОбъекта.Вставить("Дата",                                Формат(ДанныеШапки.Дата,"ДЛФ=D"));
	ДанныеОбъекта.Вставить("ВариантУказанияСрокаПоставки",        ДанныеШапки.ВариантУказанияСрокаПоставки);
	ДанныеОбъекта.Вставить("УсловияОплаты",                       ДанныеШапки.УсловияОплаты);
	ДанныеОбъекта.Вставить("УсловияДоставки",                     ДанныеШапки.УсловияДоставки);
	ДанныеОбъекта.Вставить("ПрочиеУсловия",                       ДанныеШапки.ПрочиеУсловия);
	ДанныеОбъекта.Вставить("КонтактнаяИнформацияПредложения",     КонтактнаяИнформацияПредложения(ДанныеОбъекта));
	ДанныеОбъекта.Вставить("ИтоговаяСтрока",                      ПредставлениеСуммДокумента.ИтоговаяСтрока);
	ДанныеОбъекта.Вставить("СуммаПрописью",                       ПредставлениеСуммДокумента.СуммаПрописью);
	ДанныеОбъекта.Вставить("ЕстьСкидки",                          ЕстьСкидки);
	ДанныеОбъекта.Вставить("ПредставлениеСрокаДействия",          КоммерческиеПредложенияДокументы.ПредставлениеСрокаДействияДляПечати(ЕстьСкидки, ДанныеШапки.СрокДействия));
	ДанныеОбъекта.Вставить("ПредставлениеЧастичногоВыкупа",       КоммерческиеПредложенияДокументы.ПредставлениеЧастичногоВыкупаДляПечати(ДанныеШапки.МожетВыкупатьсяЧастично));
	ДанныеОбъекта.Вставить("УсловияПоставкиПредставление",        КоммерческиеПредложенияДокументы.ПредставлениеУсловийПоставкиДляПечати(ДанныеОбъекта.УсловияОплаты, 
	ДанныеОбъекта.УсловияДоставки, 
	ДанныеОбъекта.ПрочиеУсловия)); 
	#Вставка 
	//·++·Гурьев·17.08.23·#2.9·Добавление доп. данных
	ДанныеОбъекта.Вставить("ИННОрганизации",                      ДанныеОрганизации.ИНН);
	ДанныеОбъекта.Вставить("ТелефонОрганизации",                  ДанныеОрганизации.Телефоны);
	ДанныеОбъекта.Вставить("ПочтаОрганизации",                    ДанныеОрганизации.АдресЭлектроннойПочты);
	ДанныеОбъекта.Вставить("УчитыватьНДС",                        ДанныеШапки.УчитыватьНДС);
	ДанныеОбъекта.Вставить("ЦенаВключаетНДС",                     ДанныеШапки.ЦенаВключаетНДС);
	ДанныеОбъекта.Вставить("КАНАТ_НеИспользуетсяВГОЗ",            ДанныеШапки.КАНАТ_НеИспользуетсяВГОЗ);
	ДанныеОбъекта.Вставить("КАНАТ_ИнформацияДляПокупателя",       ДанныеШапки.КАНАТ_ИнформацияДляПокупателя);
	//·++·Гурьев·21.08.23
	#КонецВставки

	#КонецОбласти

	Возврат ДанныеОбъекта;

КонецФункции

&ИзменениеИКонтроль("ДанныеДляПечати")
Функция КАНАТ_ДанныеДляПечати(МассивОбъектов, ПараметрыПечати)

	СтруктураДанныхДляПечати = Неопределено;
	СтандартнаяОбработка = Истина;
	КоммерческиеПредложенияДокументыПереопределяемый.КоммерческоеПредложениеКлиентуПриФормированииСтруктурыДанныхПечати(
	МассивОбъектов,
	СтруктураДанныхДляПечати,
	ПараметрыПечати,
	СтандартнаяОбработка);

	Если Не СтандартнаяОбработка Тогда
		Возврат СтруктураДанныхДляПечати;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	ОтображатьСкидки = Истина;
	Если ПараметрыПечати.Свойство("ОтображатьСкидки")
		И Не ПараметрыПечати.ОтображатьСкидки Тогда
		ОтображатьСкидки = Ложь;
	КонецЕсли;

	Запрос.УстановитьПараметр("ОтображатьСкидки", ОтображатьСкидки);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоммерческоеПредложениеКлиенту.Ссылка                              КАК Ссылка,
	|	КоммерческоеПредложениеКлиенту.Дата                                КАК Дата,
	|	КоммерческоеПредложениеКлиенту.Номер                               КАК Номер,
	|	КоммерческоеПредложениеКлиенту.Менеджер                            КАК Менеджер,
	|	КоммерческоеПредложениеКлиенту.КонтактноеЛицо                      КАК КонтактноеЛицо,
	|	КоммерческоеПредложениеКлиенту.Организация                         КАК Организация,
	|	КоммерческоеПредложениеКлиенту.СрокДействия                        КАК СрокДействия,
	|	КоммерческоеПредложениеКлиенту.Валюта                              КАК Валюта,
	|	КоммерческоеПредложениеКлиенту.ЦенаВключаетНДС                     КАК ЦенаВключаетНДС,
	|	КоммерческоеПредложениеКлиенту.Налогообложение                     КАК УчитыватьНДС,
	|	КоммерческоеПредложениеКлиенту.УсловияДоставкиТекст                КАК УсловияДоставки,
	|	КоммерческоеПредложениеКлиенту.УсловияОплатыТекст                  КАК УсловияОплаты,
	|	КоммерческоеПредложениеКлиенту.ПрочаяДополнительнаяИнформацияТекст КАК ПрочиеУсловия,
	|	КоммерческоеПредложениеКлиенту.Клиент                              КАК Клиент,
	|	КоммерческоеПредложениеКлиенту.Контрагент                          КАК Контрагент,
	|	КоммерческоеПредложениеКлиенту.ВариантУказанияСрокаПоставки        КАК ВариантУказанияСрокаПоставки,
	#Вставка
	|	КоммерческоеПредложениеКлиенту.КАНАТ_НеИспользуетсяВГОЗ            КАК КАНАТ_НеИспользуетсяВГОЗ,
	|	КоммерческоеПредложениеКлиенту.КАНАТ_ИнформацияДляПокупателя       КАК КАНАТ_ИнформацияДляПокупателя,
	#КонецВставки
	|	КоммерческоеПредложениеКлиенту.МожетВыкупатьсяЧастично             КАК МожетВыкупатьсяЧастично
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
	|ГДЕ
	|	КоммерческоеПредложениеКлиенту.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Ссылка                                                   КАК Ссылка,
	|	Товары.НомерСтроки                                              КАК НомерСтроки,
	|	Товары.Номенклатура                                             КАК Номенклатура,
	|	Товары.Характеристика                                           КАК Характеристика,
	|	Товары.СуммаРучнойСкидки + Товары.СуммаАвтоматическойСкидки     КАК СуммаСкидки,
	|	Товары.ПроцентРучнойСкидки + Товары.ПроцентАвтоматическойСкидки КАК ПроцентСкидки,
	|	&УсловияЕдиницыИзмерения                                        КАК ЕдиницаИзмерения,
	|	Товары.Количество                                               КАК Количество,
	|ВЫБОР
	|	КОГДА &ОтображатьСкидки
	|		ТОГДА Товары.Цена
	|	ИНАЧЕ ВЫБОР
	|			КОГДА Товары.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ Товары.Сумма / Товары.Количество
	|		КОНЕЦ
	|КОНЕЦ                                                              КАК Цена,
	|	Товары.СуммаСНДС                                                КАК СуммаСНДС,
	|	Товары.Сумма                                                    КАК Сумма,
	|	Товары.СуммаНДС                                                 КАК СуммаНДС,
	|	Товары.СрокПоставки                                             КАК СрокПоставки
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";

	УсловияЕдиницыИзмерения = "Товары.ЕдиницаИзмерения";
	КоммерческиеПредложенияДокументыПереопределяемый.ПолучитьТекстЗапросаПолученияЕдиницыИзмерения(УсловияЕдиницыИзмерения);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияЕдиницыИзмерения", УсловияЕдиницыИзмерения);

	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет(); // Массив из ВыборкаИзРезультатаЗапроса

	СтруктураДанныхДляПечати = Новый Структура;
	СтруктураДанныхДляПечати.Вставить("РезультатПоШапке",   ПакетРезультатовЗапроса[0]);
	СтруктураДанныхДляПечати.Вставить("РезультатПоТоварам", ПакетРезультатовЗапроса[1]);

	Возврат СтруктураДанныхДляПечати;

КонецФункции
